/* Task view. */
HSDFSD_TaskName = "Faksin pikavalinnat";
HSDFPB_TaskName = "Faksin puhelinluettelo";
HSDFSD_TaskDescription = "Käytä +/- -painikkeita tai kirjoita haluamasi tiedot laitteen pikavalintamuistiin. Voit myös hakea ja lisätä tiedot osoitekirjasta.";
HSDFPB_TaskDescription = "Faksin puhelinluettelon avulla voit tarkastella ja hallita laitteesi yhteystietoluetteloa.\nVoit lisätä ja poistaa yhteystietoja painikkeilla + ja -. Voit myös etsiä lisää yhteystietoja Yhteystiedot-toiminnon avulla ja lisätä ne luetteloon.";

ActionMenuTooltip = "Toimintovalikko";

HSDEntryIndexColumnTitle = "#";
HSDEntryNameColumnTitle = "Nimi";
HSDEntryPhoneNumberColumnTitle = "Faksinumero";
HSDEntryEditActionMenuTitle = "Muokkaa…";
HSDEntryCreateGroupActionMenuTitle = "Luo ryhmä…";
EntriesStatusCaption = "%1$d / %2$d valintaa käytetty";
HSDPrintListButtonTitle = "Tulosta luettelo";
/* Use common localized key instead of plug-in "MoreInfoButtonTitle". */
AddressBookLaunchButtonTooltip = "Avaa faksiosoitekirja";
ContactsLaunchButtonTooltip = "Avaa faksin yhteystiedot";
HSDApplyButtonTitle = "Ota käyttöön";

HSDDismissEntryButtonTitle = "Peruuta";
HSDConfirmEntryButtonTitle = "Tallenna";

HSDFPB_AddNewContactToolTip = "Lisää uusi yhteystieto";
HSDFSD_AddNewContactToolTip = "Lisää uusi pikavalinta";
HSDFPB_DeleteSelectedContactToolTip = "Poista valitut yhteystiedot tai ryhmät";
HSDFSD_DeleteSelectedContactToolTip = "Poista valitut pikavalinnat tai ryhmät";
HSDFPB_PrintListButtonToolTip = "Tulosta kaikki tälle laitteelle tallennetut yhteystiedot";
HSDFSD_PrintListButtonToolTip = "Tulosta kaikki tälle laitteelle tallennetut pikavalinnat";

/* Individual entry panel. */
HSDFPB_IndividualEntryIndexFieldCaption = "Merkintä (#):";
HSDFSD_IndividualEntryIndexFieldCaption = "Pikavalinta (#):";
HSDIndividualEntryNameFieldCaption = "Nimi:";
HSDIndividualEntryPhoneNumberFieldCaption = "Faksinumero:";

/* Group entry panel. */
HSDFPB_GroupEntryIndexFieldCaption = "Merkintä (#):";
HSDFSD_GroupEntryIndexFieldCaption = "Pikavalinta (#):";
HSDGroupEntryNameFieldCaption = "Ryhmän nimi:";
HSDFSD_GroupEntryItemsDescription = "Valitse pikavalinnat, jotka haluat lisätä tähän ryhmään.";
HSDFPB_GroupEntryItemsDescription = "Valitse yhteystiedot, jotka haluat lisätä tähän ryhmään.";

/* More Info panel. */
HSDConfirmMoreInfoButtonTitle = "OK";

/* Contacts panel. */
AddressBookPanelTitle = "Faksiosoitekirja";
ContactsPanelTitle = "Faksin yhteystiedot";
HSDDismissContactsButtonTitle = "Sulje";
HSDConfirmContactsButtonTitle = "Lisää";

/* Alert dialogs. */
CancelAlertButtonTitle = "Peruuta";
RemoveFromGroupAlertButtonTitle = "Poista ryhmästä";
DeleteAlertButtonTitle = "Poista";
ApplyAlertButtonTitle = "Käytä";
DontApplyAlertButtonTitle = "Älä käytä";

IncorrectDeviceStateAlertTitle = "Tulostin on virhetilassa";
IncorrectDeviceStateAlertMessage = "Ratkaise laitteen virhetila ja yritä uudelleen.";

HSDFSD_InvalidEntryErrorTitle = "Virheellinen pikavalinta";
HSDFPB_InvalidEntryErrorTitle = "Yhteystietoa ei voi lisätä";
HSDFSD_MissingEntryNameErrorMessage = "Pikavalinnan nimi puuttuu. Anna pikavalinnan nimi ja yritä uudelleen.";
HSDFPB_MissingEntryNameErrorMessage = "Yhteystiedon nimi puuttuu. Anna yhteystiedon nimi ja yritä uudelleen.";
HSDFSD_MissingEntryPhoneNumberErrorMessage = "Pikavalinnan numero puuttuu. Anna pikavalinnan numero ja yritä uudelleen.";
HSDFPB_MissingEntryPhoneNumberErrorMessage = "Yhteystiedon numero puuttuu. Anna yhteystiedon numero ja yritä uudelleen.";
HSDFSD_TooLargeGroupErrorMessage = "Pikavalintaryhmä on liian suuri. Laite tukee enintään %d syötettä ryhmässä.";
HSDFPB_TooLargeGroupErrorMessage = "Ryhmässä on liikaa yhteystietoja. Laite tukee enintään %d yhteystietoa ryhmää kohti.";

HSDFSD_DeleteIndividualEntryAlertTitle = "Haluatko varmasti poistaa kohteen \"%@\" pikavalinnan?";
HSDFPB_DeleteIndividualEntryAlertTitle = "Haluatko varmasti poistaa yhteystiedon \"%@\"?";
HSDFSD_DeleteIndividualEntryAlertMessage = "Valittu pikavalinta on yhdessä tai useammassa ryhmässä. Pikavalinnan poistaminen poistaa sen ryhmistä.";
HSDFPB_DeleteIndividualEntryAlertMessage = "Valittu yhteystieto esiintyy yhdessä tai useammassa ryhmässä. Yhteystiedon poistaminen poistaa sen kaikista ryhmistä.";
HSDFSD_DeleteMultipleIndividualEntriesAlertTitle = "Haluatko varmasti poistaa valitut pikavalinnat?";
HSDFPB_DeleteMultipleIndividualEntriesAlertTitle = "Haluatko varmasti poistaa valitut yhteystiedot?";
HSDFSD_DeleteMultipleIndividualEntriesAlertMessage = "Osa valituista pikavalinnoista saattaa olla yhdessä tai useammassa ryhmässä. Pikavalintojen poistaminen poistaa ne ryhmistä.";
HSDFPB_DeleteMultipleIndividualEntriesAlertMessage = "Jotkin valituista yhteystiedoista esiintyvät mahdollisesti useammassa ryhmässä. Yhteystietojen poistaminen poistaa ne kaikista ryhmistä.";

HSDFSD_DeleteGroupEntryAlertTitle = "Haluatko varmasti poistaa pikavalintaryhmän \"%@\"?";
HSDFPB_DeleteGroupEntryAlertTitle = "Haluatko varmasti poistaa ryhmän \"%@\"?";
HSDFSD_DeleteGroupEntryAlertMessage = "Valitun ryhmän sisältämiä yksittäisiä pikavalintoja ei poisteta.";
HSDFPB_DeleteGroupEntryAlertMessage = "Ryhmään kuuluvia yksittäisiä yhteystietoja EI poisteta.";
HSDFSD_DeleteMultipleGroupEntriesAlertTitle = "Haluatko varmasti poistaa valitut pikavalintaryhmät?";
HSDFPB_DeleteMultipleGroupEntriesAlertTitle = "Haluatko varmasti poistaa valitut ryhmät?";
HSDFSD_DeleteMultipleGroupEntriesAlertMessage = "Valitun ryhmän sisältämiä yksittäisiä pikavalintoja ei poisteta.";
HSDFPB_DeleteMultipleGroupEntriesAlertMessage = "Ryhmiin kuuluvia yksittäisiä yhteystietoja EI poisteta.";

HSDFSD_DeleteIndividualEntryFromGroupAlertTitle = "Haluatko varmasti poistaa pikavalinnan kohteelle \"%1$@\" ryhmästä \"%2$@\"?";
HSDFPB_DeleteIndividualEntryFromGroupAlertTitle = "Haluatko varmasti poistaa yhteystiedon \"%1$@\" ryhmästä \"%2$@\"?";
HSDFSD_DeleteIndividualEntryFromGroupAlertMessage = "Kun Poista ryhmästä -vaihtoehto valitaan, pikavalinta poistetaan ainoastaan ryhmästä. Itse pikavalintaa ei poisteta.\nOsoita Poista, jos haluat poistaa pikavalinnan pysyvästi ja myös kaikista ryhmistä.";
HSDFPB_DeleteIndividualEntryFromGroupAlertMessage = "Jos valitset Poista ryhmästä, pikavalinta poistetaan ryhmästä, mutta itse pikavalintaa ei poisteta.\nValitse Poista, jos haluat poistaa pikavalinnan pysyvästi kaikista ryhmistä.";
HSDFSD_DeleteMultipleEntriesFromGroupAlertTitle = "Haluatko varmasti poistaa valitut pikavalinnat ryhmästä \"%@\"?";
HSDFPB_DeleteMultipleEntriesFromGroupAlertTitle = "Haluatko varmasti poistaa valitut yhteystiedot ryhmästä \"%@\"?";
HSDFSD_DeleteMultipleEntriesFromGroupAlertMessage = "Kun Poista ryhmästä -vaihtoehto valitaan, pikavalinnat poistetaan ainoastaan ryhmästä. Itse pikavalintoja ei poisteta.\nOsoita Poista, jos haluat poistaa valitut pikavalinnat pysyvästi ja myös kaikista ryhmistä.";
HSDFPB_DeleteMultipleEntriesFromGroupAlertMessage = "Jos valitset Poista ryhmästä, pikavalinnat poistetaan ryhmästä, mutta itse pikavalintoja ei poisteta.\nValitse Poista, jos haluat poistaa valitut pikavalinnat pysyvästi kaikista ryhmistä.";
HSDFSD_DeleteMultipleEntriesFromMultipleGroupsAlertTitle = "Haluatko varmasti poistaa valitut pikavalinnat niiden ryhmistä?";
HSDFPB_DeleteMultipleEntriesFromMultipleGroupsAlertTitle = "Haluatko varmasti poistaa valitut yhteystiedot ryhmistään?";
HSDFSD_DeleteMultipleEntriesFromMultipleGroupsAlertMessage = "Kun Poista ryhmästä -vaihtoehto valitaan, pikavalinnat poistetaan ainoastaan ryhmistä, joihin ne kuuluvat. Itse pikavalintoja ei poisteta.\nOsoita Poista, jos haluat poistaa pikavalinnat pysyvästi ja myös kaikista ryhmistä.";
HSDFPB_DeleteMultipleEntriesFromMultipleGroupsAlertMessage = "Jos valitset Poista ryhmästä, pikavalinnat poistetaan ryhmistään, mutta itse pikavalintoja ei poisteta.\nValitse Poista, jos haluat poistaa pikavalinnat pysyvästi kaikista ryhmistä.";

HSDFSD_DeleteMixedEntriesAlertTitle = "Haluatko varmasti poistaa valitut pikavalinnat ja pikavalintaryhmät?";
HSDFPB_DeleteMixedEntriesAlertTitle = "Haluatko varmasti poistaa valitut yhteystiedot ja ryhmät?";
HSDFSD_DeleteMixedEntriesAlertMessage = "Kun napsautat Poista, valitut yksittäiset Pikavalinnat ja Ryhmät poistetaan pysyvästi. Yksittäisiä pikavalintoja valituissa ryhmissä EI poisteta, ellei sitä ole valittu yksittäin poistoa varten.";
HSDFPB_DeleteMixedEntriesAlertMessage = "Jos valitset Poista, vain valitut yhteystiedot ja ryhmät poistetaan pysyvästi. Yksittäisiä yhteystietoja, jotka kuuluvat valittuihin ryhmiin mutta joita ei ole suoraan valittu, EI poisteta.";

DenyContactsAccessAlertTitle = "Tiedot eivät ole saatavilla";
DenyContactsAccessAlertMessage = "Sovellusta \"%@\" ei voi käyttää.\nVoit poistaa eston Järjestelmäasetukset Suojaus ja yksityisyys -paneelista.";

HSDFSD_AllowsToCommitChangesAlertTitle = "Faksin pikavalintojen luetteloa on muokattu";
HSDFPB_AllowsToCommitChangesAlertTitle = "Faksin puhelinluetteloa on muokattu. Haluatko tallentaa muutokset ennen tulostamista?";
AllowsToCommitChangesAlertMessage = "Tulostettu luettelo ei sisällä tehtyjä muutoksia, jollei niitä oteta käyttöön. Haluatko ottaa luetteloon tekemäsi muutokset käyttöön ennen luettelon tulostamista?";

/* Progress dialogs. */
PrintInitializingDialogTitle = "Käsitellään…";
PrintProcessingDialogTitle = "Tulostetaan… Odota";
